#Задача 1 (Доступ к символам)
#Дана строка:

#python
text = "Python"
#Выведи на экран первый и последний символы этой строки (каждый на отдельной строке).

#Подсказка (если понадобится):

#Используй индексацию (помни, что индексы начинаются с 0).

result = text [0]
result1 = text [-1]
print(result)
print(result1)