#Задача 1 (Арифметические операции)
#Создай две переменные: a = 5 и b = 3. Выведи на экран результат их сложения, вычитания, умножения и деления (каждое на отдельной строке).

#Напиши решение и проверь синтаксис. Если возникнут ошибки — дай знать, подскажу!

#a = 5
#b = 3
#print (a + b)
#print (a - b)
#print (a * b)
#print (a / b)


#Задача 2 (Типы данных)
#Даны три переменные:

#x = "10"
#y = 20
#z = 5.5
#Напиши код, который преобразует x в целое число, а z — в строку, затем выведет их типы данных через type()

#x = "10"
#x = int (x)
#z = 5.5
#z = str (z)
#print (type(x))
#print (type(z))


#Задача 3 (Операции сравнения)
#Даны переменные:

#k = 7
#m = 10
#Напиши код, который проверит:

#k меньше m,

#k не равно m,

#m больше или равно k.

#Выведи результаты каждого сравнения отдельно.

#Формат: print(k < m) и т.д.

#print (k < m)
#print (k != m)
#print (m >= k)

#Задача 4 (Именование переменных)
#Перед тобой некорректные имена переменных. Исправь их, соблюдая правила Python, и запиши верные варианты:

#1num = 10

#my var = "hello"

#for = 5

#Напомню правила:

#Нельзя начинать с цифры,

#Нельзя использовать пробелы или ключевые слова (как for),

#Допустимы буквы, цифры (не в начале) и _.

#num_1 = 10
#my_var = "hello"
#loop_count = 5


#Задача 5 (Преобразование типов данных)
#Даны переменные:

#price = "10"
#quantity = 2
#Нужно:

#Преобразовать price в целое число,

#Преобразовать quantity в строку,

#Вывести их новые типы через type().

#price = "10"
#price = int (price)
#print (type (price))

#quantity = 2
#quantity = str (quantity)
#print (type (quantity))


#Задача 6 (Переопределение переменной)
#Дана переменная:

#word = "Hello"
#Переопредели её значение на "Python", затем выведи на экран новое значение и её тип.

#word = "Hello"
#word = "Python"
#print (type(word))


#Задача 7 (Классификация по типам данных)
#Даны переменные:

#a = True
#b = 3.14
#c = [1, 2, 3]
#Выведи тип каждой через type().

#Пример вывода:

#<class 'bool'>
#<class 'float'>
#<class 'list'>

#a = True
#print (type (a))
#b = 3.14
#print (type (b))
#c = [1, 2, 3]
#print (type (c))


#Задача 8 (Объявление переменных)
#Объяви три переменные:

#Целое число age со значением 20,

#Строку name со значением "Anna",

#Список fruits с элементами ["apple", "banana"].

#Выведи их значения в одну строку через пробел:

#20 Anna ["apple", "banana"]

#age = 20
#name = "Anna"
#fruits = ["apple", "banana"]
#print(age, name, fruits)

#Задача:
#Даны переменные:


#x = 10
#y = 4
#Выведи результаты:

# деления x на y,

#Остатка от деления x на y,

#Возведения y в степень 2.

#Формат вывода:
#Каждый результат — на новой строке.

#Пример:

#x = 10
#y = 4
#print (x//4)
#print (x%y)
#print(y**2)


#Задача 1 (Арифметические операции)
#Создай переменные x = 10 и y = 2. Выведи результат:

#Возведения x в степень y,

#Целочисленного деления x на y,

#Остатка от деления x на y.

#Каждый результат — на новой строке.

#x = 10
#y = 2
#print(x ** y)
#print(x // y)
#print(x % y)

#Задача 2 (Типы данных)
#Даны значения:

#python
#a = "25"
#b = True
#c = 100.5
#Выведи тип каждой переменной через type() в формате:

#text
#Тип a: <class 'str'>
#Тип b: <class 'bool'>
#Тип c: <class 'float'>

a = "25"
b = True
c = 100.5

print("Тип a:", type(a))
print("Тип b:", type(b))
print("Тип c:", type(c))

#Задача 3 (Операции сравнения)
#Даны переменные:

#python
#num1 = 15
#num2 = 20
#Выведи результаты следующих сравнений (каждое с новой строки):

#num1 больше num2,

#num1 не равно num2,

#num2 больше или равно num1.

num1 = 15
num2 = 20

print (num1 > num2)
print (num1 != num2)
print (num2 >= num1)















