#Задача 2 (Срезы строк)
#Дана строка:

#python
word = "Автоматизация"
#Выведи на экран срез строки с 3-го по 7-й символ включительно (нумерация с 0).

#Подсказка (если нужно):

#Помни, что срезы работают как [start:end], где end не включается.

result = word [3:7]
print(result)