#Задача 1 (Получение элементов списка)
#Дан список:

#python
#fruits = ["apple", "banana", "cherry", "orange"]
#Выведи на экран второй элемент списка (по индексу) и последний элемент (используя отрицательный индекс).
#result = fruits[1]
#result1 = fruits[-1]

#print(result, result1)

#Задача 2 (Добавление элементов в список)
#Дан пустой список:

#python
numbers = []
#Добавь в него числа 1, 2 и 3 последовательно с помощью метода .append(), затем выведи список.
numbers.append(1)
numbers.append(2)
numbers.append(3)
print(numbers)