#Задача 5 (Замена элементов в списке)
#Дан список:

#python
colors = ["красный", "синий", "зелёный", "жёлтый"]  
#Замени "синий" на "фиолетовый" и выведи обновлённый список.
colors[1] = "фиолетовый"
print(colors)
