#Задача 2 (Срезы строк)
#Дана строка:

#python
#word = "Автоматизация"
#Выведи на экран срез строки с 3-го по 7-й символ включительно (нумерация с 0).

#Подсказка (если нужно):

#Помни, что срезы работают как [start:end], где end не включается.

#result = word [3:7]
#print(result)

#Задача 3 (F-строки)
#Даны переменные:

#python
city = "Москва"
temperature = 20
#Создай строку через f-строку в формате:
#"В городе Москва сейчас 20 градусов."
#и выведи её на экран.

text = f"В городе {city} сейчас {temperature} градусов"
print(text)