#Задача 1 (Получение элементов списка)
#Дан список:

#python
fruits = ["apple", "banana", "cherry", "orange"]
#Выведи на экран второй элемент списка (по индексу) и последний элемент (используя отрицательный индекс).
result = fruits[1]
result1 = fruits[-1]

print(result, result1)
